{
  "architectures": [
    "ElectraForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "embedding_size": 128,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 256,
  "id2label": {
    "0": "DT-B",
    "1": "DT-I",
    "10": "TI-B",
    "11": "TI-I",
    "12": "O",
    "2": "LC-B",
    "3": "LC-I",
    "4": "OG-B",
    "5": "OG-I",
    "6": "PS-B",
    "7": "PS-I",
    "8": "QT-B",
    "9": "QT-I"
  },
  "initializer_range": 0.02,
  "intermediate_size": 1024,
  "label2id": {
    "DT-B": 0,
    "DT-I": 1,
    "LC-B": 2,
    "LC-I": 3,
    "O": 12,
    "OG-B": 4,
    "OG-I": 5,
    "PS-B": 6,
    "PS-I": 7,
    "QT-B": 8,
    "QT-I": 9,
    "TI-B": 10,
    "TI-I": 11
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "electra",
  "num_attention_heads": 4,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "summary_activation": "gelu",
  "summary_last_dropout": 0.1,
  "summary_type": "first",
  "summary_use_proj": true,
  "type_vocab_size": 2,
  "vocab_size": 32200
}
